call ch1_0 from ch1

label ch0_0:
    # chapter transition
    scene bg black with fade
    show text "{size=+36}{font=temingti.ttf}序章{/font}{/size}" at truecenter with fade
    pause 1.0
    scene bg black with Dissolve(0.5)
    
    # start
    scene bg laboratory

    nvl_narrator "歐克里斯，我出生以來生活的世界。"
    nvl_narrator "這裡的一切均由「諾特」組成，它是目前大陸上發現到的最小基本粒子。"
    nvl_narrator "它組成了水、火、土、風等元素，這些元素又進一步組合而成為這世界中所有的自然造物。"
    nvl_narrator "有極大多數的人擁有操控諾特的能力，若將它依特定順序及位置排列後，就可以生成相對應的自然造物與魔法，這就是釋放魔法的途徑。"
    nvl clear
    nvl_narrator "雖然我們具有操縱魔法的能力，但這裡卻有一種生物，我們稱之為「魔物」，它擁有強大的魔力與侵略性，並以人類為食。"
    nvl_narrator "它們在很久很久以前便出現了，那時的人們為了抵禦它們的侵略，開始建立城邦、利用魔法與武器來與之抗衡。"
    nvl_narrator "後來在侵襲與防守之間達到一種平衡，但這樣的平衡在阿雷格爾前50年就被打破了，因為不明原因讓魔物的攻擊性大幅上升，人們的能力無法抵禦突然暴漲的攻擊力，導致許多城邦被掠奪，人類損失慘重。"
    nvl_narrator "其中還出現了高智慧的魔物，它習得了人類的語言，還稱自己為「魔物之王」，並策畫了許多組織性的進攻，向人類宣戰，當時的人們對它甚是恐懼，所以給了它一個「迪弗爾(Devil)」的稱號。"
    nvl clear
    nvl_narrator "人們在這樣的狀況下節節敗退，這些流離失所的人群中，有些人站出來成為「冒險者」，在「冒險者公會」的帶領與各城邦間的相互支援下，開始一些較有系統性的防禦與反擊。"
    nvl_narrator "在眾人的努力下，阿雷格爾32年聯合軍隊終於凱旋而歸，結束了這一段動盪不安的時代。"
    nvl_narrator "在迪弗爾被打敗之後，雖然還有些魔物的殘黨，想效仿迪弗爾統領魔物們向人類繼續發起攻勢，但畢竟不是當初的迪弗爾，所以聲勢不大實力不強。"
    nvl_narrator "歐克里斯終於迎來一段較為和平的年代，最多是冒險者們清理魔物殘黨，各個城邦間雖失去凝聚力，但也在這樣安詳的時代逐漸繁華了起來。"
    nvl clear
    nvl_narrator "戰後的復甦僅僅持續到阿雷格爾79年，忽然許多高階魔物向一位人形魔物俯首稱臣，這個人型魔物就像人類一樣，卻有著超級強大的戰鬥力與比常人還要聰穎的腦袋。"
    nvl_narrator "它特別擅長空間類的魔法，許多前往討伐的軍隊與冒險者的隊伍均全數消失，並會在三五年後再次出現在歐克里斯的某個遙遠的角落，而且會失去期間的所有記憶。"
    nvl_narrator "雖然其餘魔物的攻擊性明顯降低，人們的傷亡並沒有像第一次那麼嚴重，但是因為討伐難度更甚迪弗爾，所以被人們認為是第二個魔物之王「伊洛」。"
    nvl_narrator "阿雷格爾103年，終於有一隻冒險者隊伍「鬼音鈴」脫穎而出，他們找到了失蹤事件的起因，是由於地底迷宮伊洛所設置的陷阱所導致的，他們突破了迷宮，成功斬殺伊洛，結束了此次魔物侵襲的時代。"
    nvl clear
    nvl_narrator "在此之後，歐克里斯上的冒險者與軍隊們依舊著手清理魔物殘部的工作，但是這次的清剿特別順利，因為許多高階魔物的消滅均已被實行，剩下的都不足為懼。"
    nvl_narrator "阿雷格爾146年後，再無任何魔物出沒的痕跡，人們普天同慶，慶祝魔物的滅絕，終於結束多年來人類的噩夢。"
    nvl clear
    nvl_narrator "直至今年，阿雷格爾214年，人們終於過上了和平的年代，在這約50年間，歐克里斯逐漸繁榮起來，各城邦間貿易興盛，一切和樂融融。"
    nvl_narrator "除了商業上的發展，魔法師們開始著重研究於歐克里斯運行的法則、世界的起源上，所以在魔法上也有重大的研究與進展，他們相信一切的答案就在過去。"
    nvl_narrator "所以魔法學會研究出時間回溯魔法「Da Capo」，可以將人或是物體移動到另一個時間點，術學者為魔法師中的理論派，開始了他們時空旅行的旅程。"
    nvl_narrator "他們多次回溯回之前的年代，並把所見所聞記錄下來，有大批術學者對此做出貢獻，才有我們現今所見到的歷史。"
    nvl clear
    nvl_narrator "但在這其中有一個多年未解的難題，也就是「阿類格爾謎團」，人們至今無法回溯到阿雷格爾前200年的時代，所有想到達那個時代的學者幾乎都是有去無回，至今沒有人知道那裏到底發生了甚麼，所以那個時代被稱為「時間斷崖」。"
    nvl_narrator "時間斷崖被認為是這個世界的起源，只要去了解、研究它，就能知道歐克里斯所有的真相，所以儘管時間斷崖非常神秘，至今仍有許多狂熱的學者致力於研究此謎團。"
    nvl_narrator ""
    nvl_narrator "而時至今日，謎團依舊沒有解開......"
    nvl clear
    
    show college
    q "嘿！早啊，[username]！你今天來的真早。"
    "我聞聲抬起頭來，映入眼簾的是我在 Da Capo 研究組的前輩[college]。"
    u "嗯......，早安。"
    coll "……\n 還真是一句多的話都沒有呢。"
    "……[college]小聲地說了甚麼？\n不過他依舊如此朝氣蓬勃啊，雖然有點打擾到我了。"

    menu:        
        "覺得有點煩躁，出聲阻止他繼續說下去。":
            u "前輩你有點吵到我了......。"
            coll "嘛......你就跟我聊個天嘛。"

        "今天心情不錯，繼續聽他說下去。":
            u "你今天來的也挺早啊。"
            coll "對啊，我提早來整理最近研究組的資料。"
        
        "毫無反應，不予理會。":
            u "……"

    coll "從以前就很想問你了，之前你還沒加入時就有聽說你是非常年輕而且魔法資質很高的魔法師，但通常這樣的人可能會選擇去當術者吧！\n也許會有比較大的發揮空間，但你卻選擇了當以研究理論的為主的術學者？"
    "雖然人們對日常中的事物都習以為常，但我對這個世界的運作十分好奇。\n就像為何我們能操控諾特這個基本粒子？為何我們能將其排列就能製造魔法？"
    "這背後的原理是甚麼？如今也沒有人能解釋清楚。"
    u "要說為什麼......，大概是我對這個世界充滿了好奇吧。\n我想去找出這世界運行的原理。"
    coll "喔喔，所以是因為這樣才加入我們 Da Capo 研究組的嗎？"
    u "嗯，我想以我的能力，能幫上一些忙的......。"
    "現在大多學術的推測都是解開了阿雷格爾謎團，就可以找到歐克里斯的起源。\n我能將我的能力投入研究，或許可以讓真相離我們更近吧......。"
    coll "是啊是啊，你來了之後我們的研究可是有飛躍性的進展呢！\n真的是多虧了你呢！"
    coll "啊！對了對了，你最近參與的時空回溯計畫進行得如何了？"
    u "還挺順利的，再做一些事前準備，過幾天就能進行時空回溯了。"
    coll "聽起來很不錯呢！我會期待你們的好消息的！"
    u "嗯，謝謝。"
    coll "如果[username]平時多笑笑那就更好了喔~~"
    "……不知道這次的回溯是否能成功呢......。"

    jump ch1_0  #嘗試借跳ch1return
