call ch1_0 from ch1

label ch0_0:
    nvl_narrator "歐克里斯，我出生以來生活的世界。"
    nvl clear
    nvl_narrator "這裡的一切均由「諾特」組成，它是目前大陸上發現到的最小基本粒子。"
    nvl_narrator "它組成了水、火、土、風等元素，這些元素又進一步組合而成為這世界中所有的自然造物。
有極大多數的人擁有操控諾特的能力，若將它依特定順序及位置排列後，就可以生成相對應的自然造物與魔法，這就是釋放魔法的途徑。"
    nvl clear
    nvl_narrator "雖然我們具有操縱魔法的能力，但這裡卻有一種生物，我們稱之為「魔物」，它擁有強大的魔力與侵略性，並以人類為食。"
    nvl_narrator "它們在很久很久以前便出現了，那時的人們為了抵禦它們的侵略，開始建立城邦、利用魔法與武器來與之抗衡。"
    nvl clear
    nvl_narrator "後來在侵襲與防守之間達到一種平衡，但這樣的平衡在阿雷格爾前50年就被打破了，因為不明原因讓魔物的攻擊性大幅上升，人們的能力無法抵禦突然暴漲的攻擊力，導致許多城邦被掠奪，人類損失慘重。"
    nvl_narrator "其中還出現了高智慧的魔物，它習得了人類的語言，還稱自己為「魔物之王」，並策畫了許多組織性的進攻，向人類宣戰，當時的人們對它甚是恐懼，所以給了它一個「迪弗爾(Devil)」的稱號。"
    nvl clear

    
    # return  ## return 是直接結束遊戲
    jump ch1_0  #嘗試借跳ch1