
label ch1_0:
    nvl_narrator "四周傳來了人的聲音。\n等到時空回溯帶來的暈眩感過去後，我睜開了雙眼。"
    nvl_narrator "兩旁是用木材簡單搭建起來的棚架，婦人牽著光著腳的孩子在攤販前對檯子上的水果挑挑揀揀，
    身穿毛皮衣的男人肩上扛著一隻滴著血的羔羊從我旁邊走過，還有三個醉漢躺在巷口喝酒大笑。"
    nvl_narrator "似乎是回溯到了一個市集的正中間，身旁人來人往，攤販老闆吆喝叫賣向人們推銷自家的商品，
    群眾的目光也放在老闆手中的貨品，所幸沒有人注意到突然出現在人群之中的我。"
    nvl_narrator "我盡量壓低身形，穿過人群的包圍來到一旁無人的暗巷內。"
    u "看起來時空回溯是成功了，不過應該在慎選一下抵達的地點吧，雖然有妨礙認知的魔法，但萬一被人識破就不好了。"
    u "好了......接下來就是等待諾特回復就可以進行下一次的時空回溯。"

    "畢竟有任務在身上，沒有多餘的時間和閒情逸致去到處參觀。"
    "趁著還在等待的時間，我看著市場裡忙碌的人們，盡可能去觀察這個時空的生活。"
    "人們交流的方式、使用的貨幣、衣服的穿著以及日常吃的食物，比起書上記錄的知識，眼前的光景才是這個過去的真實。"
    "我就是為了一窺真實的歷史才參加了這次時空回溯。"

    q "......你覺得這幅景象很美嗎？"
    u "誰！？"

    return