label end3_0:
    # animation
    "原本擋在我面前的透明屏障突然消失，我一頭撞進了未知的空間。"
    u "哇嗚！！\n這.....這裡是哪裡？"
    "一片漆黑的空間中，那些奇怪的符號在空中如同星辰般閃爍著。\n但是和之前見到的有不同之處，每個奇怪符號組成的區塊底下都寫著一行歐克里斯的文字。"
    u "......天氣的運作模擬、設定土地大小。\n然後那邊是人口數量、諾特與魔法的設定。"
    u "這.....這是！！\n難不成這是在解釋這個區塊裡的奇怪符號所代表的功能嗎！？"
    "我在這片空間裡四處走動，找尋更多區塊解釋來佐證我的想法。"
    u "沒錯！這個符號在剛剛那個區塊裡也多次出現過，既然這兩個區塊的功能都是在調整氣候的設定，那這個符號一定是代表氣候的意思。"
    u "原來如此，這些符號都是有跡可循的！\n只要我找到這些字符的關聯性及他們的語法，就可以修補世界的漏洞！！"
    u "黑暗中閃爍的光芒就是我的希望。\n我拿出我的筆記本，開始對著空中的符號進行分析。"
    "這是個巨大的挑戰，有成千上百個符號要去分析，不知道要花多少時間才能全部解析完，說不定窮極我的一生也沒辦法達成。"
    "難以言狀的興奮之情在心底躍動著。\n從以前到現在，我一直追求著未知的事物，好奇心使我停不下腳步。"
    "神之語言、創世的文典就擺在眼前，既使知曉了所有的一切都是照著這些被設計出來的，我依舊沒辦法去憎恨那位造物主。"
    "等我理解完世界的構造並修正世界的漏洞後，是否代表我達到了和造物主一樣的存在高度。"
    "如今我確信了在我的世界外有屬於更高次元的存在。\n究竟為何，要創造出我們？他們是否直到現在都還在觀察著我們？"
    "總有一天我會找到這個答案。"

    # chapter end
    scene bg black with dissolve
    show text "{size=+36}{font=temingti.ttf}END{/font}{/size}" at truecenter with dissolve
    pause 1.0
    scene bg black with Dissolve(0.5)

    return