label end4_0:
    "不論如何我眼前的屏障都沒有讓我通過的意思。"
    "碰——碰——碰————"
    "敲擊的聲響迴盪在純白的空間中，我只是不停地敲著看不見的牆。"
    "碰——碰——碰————"
    "在這個潔白的盡頭，連時間都被吞噬。"
    "碰——碰——碰————"
    "從手上流下的鮮紅為純白染上了色彩，隨後又消失在那抹白之中。"
    "碰——碰——碰————"
    "因為我們只是被創造出來的生物，所以不允許逃離這裡？不允許獲得被拯救的機會？"
    "碰—碰————"
    "聲音停了下來。"
    "哈—阿—哈哈——"
    "低低的、喘息般的笑聲迴盪在遼闊的空間中。"
    "兩手已經腫脹到不成原形，傷口處也爛成一團，血液源源不絕地向外滴。\n神經傳導手部的痛覺到腦部，我確實感受到了疼痛。"
    "但是這是被設計出來的吧。\n這份痛苦、這份不甘、這份悲傷全部都是被製作出來的。\n一切都是按照「某個人」的意願創造出來的。"
    "不管怎麼掙扎都是無用的，透明的牆彷彿在嘲笑我般地矗立著。"
    "算了吧，不要掙扎了，只是區區一個人造物就不要有多餘的行動。\n停手吧，放棄那虛假的正義感吧，憑我是不可能拯救世界的，就連切羅和那不知名的魔物也都沒辦法逃離那個命運。"
    u "哈哈......說不定連我抵達這裡也是必然的事。"
    u "一路上我以為是幸運獲得很多人的幫助，才能站在這裡。\n明明離真相只差一步，明明只差一點大家都能得救了，為什麼！為什麼會被阻擋在這裡啊！"
    u "只要我繼續前進總會找到方法的對吧！\n但是——但是我停在這裡的話，不是什麼都沒辦法達成嗎？"
    u "為什麼啊！為什麼要引導我知道一切卻什麼也做不了啊！！"
    u "「造物主！！！！」"
    "碰碰—碰————"
    "碰碰—碰————"
    "再怎麼敲打阻礙也不會消失。\n不論怎麼怒吼也無法掩蓋我什麼都做不了的事實。"
    "......"
    "彷彿過了很久的時間，被無盡的白淹沒的我不會知道時間的流逝。"
    "一點聲音也沒有的，世界開始崩塌。\n末日來的是這麼的平靜，黑暗覆蓋了白色的區塊，支撐著我的地板也破碎消失。"
    "我順從著重力往下掉，沒有掙扎，沒有呼救，只是心死的看著上空。"
    u "......但願我從來沒發現過真相，至少能一無所知的死去。"
    "不過，這好像也不是我能決定的事，對吧。"

    # chapter end
    scene bg black with dissolve
    show text "{size=+36}{font=temingti.ttf}END{/font}{/size}" at truecenter with dissolve
    pause 1.0
    scene bg black with Dissolve(0.5)

    return